<template>
  <div id="app">
    <div id="nav">
      <router-link to="/">Home</router-link> |
      <router-link to="/about">About</router-link>
    </div>
    <router-view/>
  </div>
</template>

<style lang="scss">
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
}

#nav {
  padding: 30px;

  a {
    font-weight: bold;
    color: #2c3e50;

    &.router-link-exact-active {
      color: #42b983;
    }
  }
}
</style>

Index Page:

Вывести на странице input с выбранным адресом доставки.

Если адрес еще не выбран - вывести кнопку "Добавить адрес".

При нажатии на кнопку или input вывести модальное окно с выбором адреса.

Modal Window:

+----------------------------+

| Адрес доставки *          |

| --------------------------- |

| | Начните вводить адрес | |

| ------------------------- |

| -------------             |

| | Сохранить |             |

| -------------             |

+---------------------------+

Модальное окно выровнить по центру по вертикали и горизонтали.

Максимальную ширину определять через props. Высота по содержимому.

Delivery Address Form:

Поле с вводом адреса доставки должно поддерживать поисковые подсказки.

Для подсказок использовать сторонний api. (yandex API - suggest)

Если поле ввода пустое - выводить список ранее введенных адресов:

[

                {value: "г Нижний Новгород, деревня Комарово, ул Животноводов, д 1"},

                {value: "г Нижний Новгород, пер. Мотальный, д 8"}

]

Валидация:

Подсказки должны соответствовать выбранному региону.

Если выбрана Москва - Московская область, если Н.Новгород - Нижегородская область.

Адрес должен быть введен с точностью до дома.

Если адрес совпадает с выбранным - вывести сообщение.

После выбора адреса выполнить POST запрос.

Пример data json:

{

                "value": "г Нижний Новгород, деревня Комарово, ул Животноводов, д 1",

                "lat": "56.300455",

                "lon": "43.938631",

                "country": "Россия",

                "city": "Нижний Новгород",

                "street": "Животноводов",

                "street_with_type": "ул Животноводов"

}

Управление состоянием - vuex.
